from pprint import pprint

ji = [
    "6.5",
    "6.5",
    "6.5",
    "6.5",
    "5.5",
    "5.5",
    "5.5",
    "5.5",
    "5.5",
    "6.5",
    "6.5",
    "6.5",
    "6.5",
    "6.5",
    "6.5",
    "6.5"
]

arr = [['第一节 11:32', '0-0', '-7.5'],
       ['第一节 11:06', '3-0', '-7.5'],
       ['第一节 10:58', '3-0', '-7.5'],
       ['第一节 10:50', '3-0', '-7.5'],
       ['第一节 10:42', '3-0', '-7.5'],
       ['第一节 10:28', '5-0', '-7.5'],
       ['第一节 10:17', '5-0', '-7.5'],
       ['第一节 10:01', '5-0', '-7.5'],
       ['第一节 09:54', '5-0', '-7.5'],
       ['第一节 09:47', '5-0', '-7.5'],
       ['第一节 09:37', '5-2', '-7.5'],
       ['第一节 09:07', '7-2', '-7.5'],
       ['第一节 08:42', '7-2', '-7.5'],
       ['第一节 08:42', '7-2', '-7.5'],
       ['第一节 08:20', '7-5', '-7.5'],
       ['第一节 07:59', '7-5', '-7.5'],
       ['第一节 07:31', '7-7', '-7.5'],
       ['第一节 07:31', '9-7', '-7.5'],
       ['第一节 07:13', '9-7', '-7.5'],
       ['第一节 07:07', '9-9', '-7.5'],
       ['第一节 06:47', '11-9', '-7.5'],
       ['第一节 06:26', '11-11', '-7.5'],
       ['第一节 06:17', '13-11', '-7.5'],
       ['第一节 06:00', '13-14', '-7.5'],
       ['第一节 05:34', '13-14', '-7.5'],
       ['第一节 05:28', '13-14', '-7.5'],
       ['第一节 05:08', '13-14', '-7.5'],
       ['第一节 05:00', '13-14', '-7.5'],
       ['第一节 04:51', '13-14', '-7.5'],
       ['第一节 04:17', '15-15', '-7.5'],
       ['第一节 04:15', '15-15', '-7.5'],
       ['第一节 03:54', '17-15', '-7.5'],
       ['第一节 03:31', '17-18', '-7.5'],
       ['第一节 03:12', '19-18', '-7.5'],
       ['第一节 03:12', '19-18', '-7.5'],
       ['第一节 02:58', '19-18', '-7.5'],
       ['第一节 02:34', '19-18', '-7.5'],
       ['第一节 01:52', '19-18', '-7.5'],
       ['第一节 01:48', '19-18', '-7.5'],
       ['第一节 01:48', '20-18', '-5.5'],
       ['第一节 00:58', '23-18', '-5.5'],
       ['第一节 00:47', '23-18', '-5.5'],
       ['第一节 00:36', '23-18', '-5.5'],
       ['第一节 00:35', '23-18', '-5.5'],
       ['第一节 00:20', '23-18', '-5.5'],
       ['第一节 00:03', '23-18', '-5.5'],
       ['第一节 00:03', '23-18', '-5.5'],
       ['第二节 06:16', '41-32', '-1.5'],
       ['第二节 05:59', '43-34', '-1.5'],
       ['第二节 05:26', '46-34', '2.5']]


def formatter(records, records_ji, output_fileName, sep_time=12, isEffect=1):
    from pandas import DataFrame
    # 实时让分 真实分差 时间 有效性
    parts = [[records[0]]]
    for i in records[1:]:
        last_elm = parts[-1][-1]  # 选择该节中最后一个元素
        if last_elm[0].strip().split()[0] == i[0].strip().split()[0]:
            parts[-1].append(i)
        else:
            parts.append([i])
    result_arr = []
    for i, part in enumerate(parts):
        start = i * 12 * 60
        for t, score, letScore in part:
            t = list(map(lambda x: int(x), t.strip().split()[1].split(":")))
            seconds = t[0] * 60 + t[1]
            currentTime = start + (sep_time * 60 - seconds)
            letScore = float(letScore)
            result_arr.append([letScore, eval(score), currentTime, isEffect])
    length = len(result_arr)
    length_ji = len(records_ji)
    if length_ji > length:
        result_arr.extend([[None, None, None] for i in range(length_ji - length)])
    else:
        records_ji.extend([None for i in range(length - length_ji)])
    result_arr2 = []
    for res, _ in zip(result_arr, records_ji):
        temp = [_]
        temp.extend(res)
        result_arr2.append(temp)
    df = DataFrame(result_arr2, columns=["即", "滚盘", "真实分差", "时间", "结果"])
    df.to_csv(f"{output_fileName}", index=False)


if __name__ == '__main__':
    formatter(arr, ji, output_fileName="data.csv")
